Potato Cooling/Linux Files/0/domain0/alphat
FoamFile { version 2.0; format ascii; class volScalarField; object alphat; }
dimensions      [1 -1 -1 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    sides               { type calculated; value uniform 0; }
    domain0_to_potato   { type calculated; value uniform 0; }
}
