Potato Cooling/Linux Files/constant/domain0/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/domain0/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    sides
    {
        type            wall;
        inGroups        1(wall);
        nFaces          800;
        startFace       71162;
    }
    domain0_to_potato
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          4872;
        startFace       71962;
        sampleMode      nearestPatchFace;
        sampleRegion    potato;
        samplePatch     potato_to_domain0;
    }
)

// ************************************************************************* //
