Potato Cooling/Linux Files/system/domain0/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    rho             { solver PCG; preconditioner DIC; tolerance 1e-7; relTol 0; }
    rhoFinal        { $rho; }
    p_rgh           { solver GAMG; smoother GaussSeidel; tolerance 1e-7; relTol 0.01; }
    p_rghFinal      { $p_rgh; relTol 0; }
    "(U|h|e)"       { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-8; relTol 0.1; }
    "(U|h|e)Final"  { $U; relTol 0; }
}
PIMPLE
{
    nOuterCorrectors    5;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    momentumPredictor   true;
    pRefPoint           (0.15 0.15 0.30);
    pRefValue           101325;
}
relaxationFactors { equations { U 0.9; h 0.9; } }
